app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (rating IN ('G','PG','PG-13','R')) ORDER BY title
---
  def index
    @movies = Movie.order(params[:sort])